import telebot

bot = telebot.TeleBot('TOKEN')

antispam_timeout = 0.1  # время ограничения отправки сообщений (в минутах)
antispam_messages_count = 2  # количество разрешенных сообщений в течение заданного промежутка времени (в штуках)

with open('./ban_words.txt', 'r', encoding='UTF8') as f:
    deny_words = [line.strip() for line in f]

word_replace = {'а': ['а', 'a', '@'],
                'б': ['б', '6', 'b'],
                'в': ['в', 'b', 'v'],
                'г': ['г', 'r', 'g'],
                'д': ['д', 'd'],
                'е': ['е', 'e'],
                'ё': ['ё', 'e'],
                'ж': ['ж', 'zh', '*'],
                'з': ['з', '3', 'z'],
                'и': ['и', 'u', 'i'],
                'й': ['й', 'u', 'i'],
                'к': ['к', 'k', 'i{', '|{'],
                'л': ['л', 'l', 'ji'],
                'м': ['м', 'm'],
                'н': ['н', 'h', 'n'],
                'о': ['о', 'o', '0'],
                'п': ['п', 'n', 'p'],
                'р': ['р', 'r', 'p'],
                'с': ['с', 'c', 's'],
                'т': ['т', 'm', 't'],
                'у': ['у', 'y', 'u'],
                'ф': ['ф', 'f'],
                'х': ['х', 'x', 'h', '}{'],
                'ц': ['ц', 'c', 'u,'],
                'ч': ['ч', 'ch'],
                'ш': ['ш', 'sh'],
                'щ': ['щ', 'sch'],
                'ь': ['ь', 'b'],
                'ы': ['ы', 'bi'],
                'ъ': ['ъ'],
                'э': ['э', 'e'],
                'ю': ['ю', 'io'],
                'я': ['я', 'ya']
                }


class User:
    def __init__(self):
        self.first_message_time = 0
        self.messages_from_user = 0


chat_ids = []
users = {}
